<a href="https://colab.research.google.com/github/Rishabh9559/Data_science/blob/main/Pandas_complete_course.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas**
Pandas is a Python library used for working with data sets.

It has functions for analyzing, cleaning, exploring, and manipulating data.

The name "Pandas" has a reference to both "Panel Data", and "Python Data Analysis" and was created by Wes McKinney in 2008.

### **why Pandas used**
* Pandas allows us to analyze big data and make conclusions based on statistical theories.
* Pandas can clean messy data sets and make them readable and relevant
* Relevant data is very important in data science.

In [1]:
# Import pandas
import pandas as pd

## **Series**
A Pandas series is like a column in a Table

It is a one dimensional array holding data of any type.

### **Labels**
Labesl is index number - start from 0 and goes on.

In [ ]:
db = pd.Series([1,2,3,4,5,6])
print(db)
w

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [ ]:
# Pandas give name
db.name = "Array"
print(db)

0    1
1    2
2    3
3    4
4    5
5    6
Name: Array, dtype: int64

### **Check Data types**

In [ ]:
print(db.dtype)

int64

In [ ]:
# iloc -> location based indexing
db.iloc[1]

np.int64(2)

In [ ]:
# multi location based
# iloc -> works only number index start from 0,1,....
db.iloc[[2,3,4]]

2    3
3    4
4    5
Name: Array, dtype: int64

### **Create Labels**
By useing index method we can used own labels name

In [ ]:
# creating index
index = ['apple', 'banana', 'mongo', 'orange', 'date','waterlemon']

db.index = index
db.name ='cost'
db

apple         1
banana        2
mongo         3
orange        4
date          5
waterlemon    6
Name: cost, dtype: int64

In [ ]:
# Retrive value
db['banana': 'date']

banana    2
mongo     3
orange    4
date      5
Name: cost, dtype: int64

### **Locate Row**
Pandas use the **loc** attribute to return one or more specified row

In [ ]:
# loc -> indexing current
# single
db.loc['banana']

np.int64(2)

In [ ]:
# loc -> retrive value by current indexing
# list of indexes
db.loc[['banana','mongo', 'waterlemon']]

banana        2
mongo         3
waterlemon    6
Name: cost, dtype: int64

##### Example 2

In [ ]:
fruit_protein = {
    "Avocado": 2.0,       # grams of protein
    "Guava": 2.6,
    "Blackberries": 2.0,
    "Oranges": 0.9,
    "Banana": 1.1,
    "Apples": 0.3,
    "Kiwi": 1.1,
    "Pomegranate": 1.7,
    "Mango": 0.8,
    "Cherries": 1.0
}

In [ ]:
fs = pd.Series(fruit_protein, name = 'Protein')
fs

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: Protein, dtype: float64

### **Conditional Selection**

In [ ]:
# Conditional Selection
## True or False

fs>2

Avocado         False
Guava            True
Blackberries    False
Oranges         False
Banana          False
Apples          False
Kiwi            False
Pomegranate     False
Mango           False
Cherries        False
Name: Protein, dtype: bool

In [ ]:
# Condtional
# return value whose value is greater then
fs[fs>1.5]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Pomegranate     1.7
Name: Protein, dtype: float64

In [ ]:
# Conditional value
# And -> &
fs[(fs>1) & (fs<2)]

Banana         1.1
Kiwi           1.1
Pomegranate    1.7
Name: Protein, dtype: float64

In [ ]:
# Conditional value
# OR -> |

fs[(fs>1) | (fs>2) ]

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Name: Protein, dtype: float64

In [ ]:
# Condtional value
# NOT -> ~
fs[~(fs>1.5)]

Oranges     0.9
Banana      1.1
Apples      0.3
Kiwi        1.1
Mango       0.8
Cherries    1.0
Name: Protein, dtype: float64

### **Modifying value**

In [ ]:
# modifiying value
fs['Mango'] = 3

print(fs['Mango'])

3.0

In [3]:
import numpy as np

| Value    | Defined in    | Type       | Equal to itself? | Typical use                     |
| -------- | ------------- | ---------- | ---------------- | ------------------------------- |
| `None`   | Python        | `NoneType` | ✅ Yes            | Missing object / null reference |
| `NaN`    | IEEE standard | `float`    | ❌ No             | Missing numeric data            |
| `np.nan` | NumPy         | `float`    | ❌ No             | Numerical arrays                |
| `pd.nan` | Pandas        | `float`    | ❌ No             | Missing values in DataFrames    |

In [ ]:
ser = pd.Series(['a', np.nan, 1, np.nan, 2])
ser.notnull().sum()

np.int64(3)

## **DataFrame**

Dat sets in Pandas are usually multi-dimensional tables, called DataFrames.

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [4]:
# DataFrame:

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}

data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [10]:
# DataFrame
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

### **loc and iloc**

* **loc** (Label-based): Access rows/columns by name or label.
  * **Example**: df.loc[0:5, 'ColumnName'] (Includes the row with label 5).

* **iloc** (Integer-based): Access rows/columns by numerical index positions.
  * **Example**: df.iloc[0:5, 2] (Excludes the row at position 5).
* **Slicing Behavior**: **loc** includes both start and stop, **iloc** includes start but excludes stop.

* **Performance**: **iloc** is generally faster as it works directly with memory positions.

In [11]:
# loc and iloc

#loc
df.loc[1:4]

      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN

In [23]:
# loc- loc[index, [column name]]
df.loc[0:3 , ["Age", "Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT

In [19]:
# loc -> retrive by index value
print(df.loc[0])
print("-------------------")
print(df.loc[2:4])

Name            Alice
Age              25.0
Department         HR
Salary        50000.0
Name: 0, dtype: object
-------------------
      Name   Age Department   Salary
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN

In [24]:
# iloc -> only retrive integer index
print(df.iloc[0])

print("-----------------")

print(df.iloc[1:4])

Name            Alice
Age              25.0
Department         HR
Salary        50000.0
Name: 0, dtype: object
-----------------
      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0

### **Columns**

In [25]:
# Columns
# Access column
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
5      Alice
Name: Name, dtype: object

In [26]:
# Delete column
# axis -> 1 For Column and 0 for Rows delete
print(df.drop('Age', axis = 1))

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [ ]:
# Inplace -> It perform in original database
# inplace = True
df.drop('Age', axis = 1, inplace=True)

### **Shape**
(Row, Columns)

In [28]:
# shape -> row and column
df.shape

(6, 4)

### data type

In [29]:
# Datatype
df.dtypes

Name           object
Age           float64
Department     object
Salary        float64
dtype: object

### **info()**
It provides a quick overview of the data's structure, potential missing values, and memory usage.

**Key Information Provided by df.info():**
* **Class and Index**: The type of object (pandas.core.frame.DataFrame) and the range index (number of entries/rows).
* **Column Details**: The number of columns, their names, the count of non-null values in each column, and each column's data type (dtype, e.g., int64, float64, object).
* **Data Types Summary**: A summary count of columns for each data type present.
* **Memory Usage**: An estimate of the memory consumed by the DataFrame.

In [30]:
# info()

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

### **`pandas.DataFrame.describe()`**

The `pandas.DataFrame.describe()` method generates **descriptive statistics** that summarize the **central tendency**, **dispersion**, and **shape** of a dataset’s distribution.  

By default, it analyzes **only numeric columns** and **excludes missing (NaN) values**.



#### Key Statistics Provided

#### **For Numeric Data (default)**
- **count**: Number of non-null observations  
- **mean**: The average value  
- **std**: The standard deviation (measure of spread)  
- **min**: The minimum value  
- **25%**: The 25th percentile (first quartile)  
- **50%**: The 50th percentile (median)  
- **75%**: The 75th percentile (third quartile)  
- **max**: The maximum value  

#### **For Object / Categorical Data**  
*(e.g., strings or timestamps, when specified)*
- **count**: Number of non-null observations  
- **unique**: Number of unique values  
- **top**: Most frequently occurring value  
- **freq**: Frequency (count) of the most frequent value

In [31]:
# describe()

df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000